:PROPERTIES:
:ID: CE523555-1A0C-42ED-96C7-B84C3FF6CB69
:END:
#+title: Generate Whimsical Database Name
#+description: Generate Whimsical Database Name
#+type: recipe
#+version: 2
#+level: cross
#+filetags: :recipe:sql:database_management:
#+created: 2026-05-21
#+updated: 2026-05-21

Generate a unique whimsical name for a new database:

#+begin_src sql
select ores_utility_generate_unique_database_name_from_server_fn();
#+end_src

#+RESULTS:
#+begin_example
ores_utility_generate_unique_database_name_from_server_fn
ores_little_morning
#+end_example
